Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd

In [2]:
pd.Series([4, 8, 15, 16, 23, 42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
a=[1,2,3,4,5,6,7,8,9,10]

In [5]:
pd.Series(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
type(a)

list

Q3. Create a Pandas DataFrame that contains the following data:

In [7]:
data=pd.DataFrame({"Name":['Alice','Bob','Clarie'],
                   "Age":[25,30,27],
                   "Gender":['Female','Male','Female']})

In [8]:
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

 a Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined.

In [9]:
df1=pd.DataFrame({"Name":['Alice','Bob','Clarie'],
                   "Age":[25,30,27],
                   "Gender":['Female','Male','Female']})

In [10]:
df2=pd.Series({"Name":['Alice','Bob','Clarie'],
                   "Age":[25,30,27],
                   "Gender":['Female','Male','Female']})

In [11]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Clarie   27  Female

In [12]:
df2

Name        [Alice, Bob, Clarie]
Age                 [25, 30, 27]
Gender    [Female, Male, Female]
dtype: object

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [14]:
type(df2)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [15]:
df=pd.read_csv("gender_submission.csv")

In [16]:
df.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [17]:
df.tail()

     PassengerId  Survived
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [19]:
df.iloc[0:2]

   PassengerId  Survived
0          892         0
1          893         1

In [20]:
df.iloc[2:15:2]

    PassengerId  Survived
2           894         0
4           896         1
6           898         1
8           900         1
10          902         0
12          904         1
14          906         1

In [21]:
df['Survived'].mean()

0.36363636363636365

In [22]:
df['PassengerId'].sum()

460009

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series is mutable.
DataFrame is mutable.
Panel is mutable.
All three data structures (Series, DataFrame, and Panel) in Pandas are mutable, meaning you can modify their contents after creation. This mutability allows you to perform various data manipulation operations, such as adding or removing elements, updating values, or changing the structure of the data.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [24]:
import pandas as pd

name_series = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age_series = pd.Series([25, 30, 22, 35])

df = pd.DataFrame({'Name': name_series, 'Age': age_series})

print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   35